# Задание 1. Факториал

def fac(n):
  pass

# Задание 2. Наибольший общий делитель (НОД) для двух целых чисел

def gcd(a, b):    
  pass

# Задание 3. Генератор для ряда Фибоначчи

def fib():   
  pass

# Задание 4. Напишите реализацию функции is_palindrome, которая проверяет, является ли последовательность палиндромом
#
# >>> is_palindrome('aba')
# True
# >>> is_palindrome('abc')
# False
# >>> is_palindrome([1, 2, 3, 2, 1])
# True

def is_palindrome(seq):
  pass


# Задание 5. Напишите реализацию функции is_unique, которая проверяет, содержит ли последовательность только уникальные элементы.
# >>> is_unique([1, 2, 3, 2, 1])
# False
# >>> is_unique([1, 2, 3, 4, 5])
# True

def is_unique(seq):
  pass


# Задание 6. Напишите реализацию функции, которая вычисляет контрольную сумму последовательности чисел по модулю 10. Аргумент -- строку, содержащую только цифры, -- необходимо преобразовать в последовательность чисел, вычислить их сумму, и вернуть остаток от деления на 10.
# Пример: '12345' -> [1, 2, 3, 4, 5] -> 15 -> 5
#
# >>> checksum('123')
# 6
# >>> checksum('1234')
# 0
# >>> checksum('12345')
# 5

def checksum(code):
  pass


# Задание 7*. Преобразование вложенных последовательностей
#
# >>> flatten([])
# []
# >>> flatten([1, 2])
# [1, 2]
# >>> flatten([1, [2, [3]]])
# [1, 2, 3]
# >>> flatten([(1, 2), (3, 4)])
# [1, 2, 3, 4]

def flatten(seq):
  pass